package org.Basics_of_Java_Programming_1.Course.Introduction_To_Java_1;
/* Простая Java-программа */
public class Welcome {//<------------------------------------------------------
    public static void main(String[ ] args) {//<-------------------              |
        // Отображает в консоли сообщение Добро пожаловать в Java!
        System.out.println("Добро пожаловать в Java!");// блок метода|  блок класса|
    }//<-----------------------------------------------------------              |
}//<---------------------------------------------------------------------------

//Консоль - устройство ввода/вывода текста
//имя класса совпадает с именем программы. Начинаются с прописной буквы.
//метод main - точка входа
//string - последовательность символом
//class, public. static, void - зарезервированные словау