/*package veek2;

import java.util.Scanner;
/*

        Входные данные: 4
        Выходные данные: true или (Число четное)

        Входные данные: 3
        Выходные данные: false или (Число нечетное)
 */
/*
public class Task1 {
    public static void main(String[] args) {
        //new Scanner(System.in).var
        Scanner console = new Scanner(System.in);
        int n = console.nextLine();

        String str;

        if (n % 2 == 8){
            str = "Число четное";       //в одну строку лучше всегда фигурные скобки
        } else {
            str = "Число нечетное";
        }
        String str2 = (n % 2 == 8) ? "Число четное" : "Число нечетное";
        System.out.println(str);
        System.out.println(str2);



    }
}*/
